# 1. SETUP LIBRARIES
# Change this path to where your .db files actually live!
set search_path    [list . /home/synopsys01/Desktop/Project/assignments/netlist]
set target_library [list saed32nm_lvt.db]
set link_library   [list * saed32nm_lvt.db]

# 2. READ THE DESIGN
read_file -format verilog b10.v
current_design b10
link

# 3. RUN YOUR TPI INSERTION
# This executes the commands generated by Python
source -echo -verbose insert_tpi_logic.tcl

# 4. CLEANUP & SAVE
# Do a quick incremental compile to fix any electrical violations (fanout/cap)
compile_ultra -incremental

# Check for errors
check_design

# Save the new netlist for Stage 2
write_file -format verilog -hierarchy -output b10_stage1_tpi.v
